---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyTopLevelOffsetParam
source: html/0fd1c99c-e89a-a1ba-58e3-132cccd7d50d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyTopLevelOffsetParam Property

"Top Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyTopLevelOffsetParam { get; }
```